BotTest/src/InformationRegisters/АккаунтыПользователей/АккаунтыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АккаунтыПользователей</name>
  <dimensions>
    <name>ЧатИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Субдомен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BotTest/src/InformationRegisters/ДанныеПодключенияСРМ/ДанныеПодключенияСРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПодключенияСРМ</name>
  <resources>
    <name>СикретКей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИДИнеграции</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АуфКод</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АксесТокен</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РефрешТокен</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Субдомен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BotTest/src/HTTPServices/tgbot/Module.bsl
Функция messageПолучитьСообщениеТелеграм(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);

	ПакетСообщения = Разобратьпакет(Запрос.ПолучитьТелоКакСтроку());
	Ответ.УстановитьТелоИзСтроки("POSTMethod is working " + ПакетСообщения.message.chat.id);
	ЧатИД = ПакетСообщения.message.chat.id;
	ИмяПользователя = (ПакетСообщения.message.from.first_name + " " + ПакетСообщения.message.from.last_name);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	АккаунтыПользователей.ЧатИД,
				   |	АккаунтыПользователей.Субдомен,
				   |	АккаунтыПользователей.ИмяПользователя
				   |ИЗ
				   |	РегистрСведений.АккаунтыПользователей КАК АккаунтыПользователей
				   |ГДЕ
				   |	АккаунтыПользователей.ЧатИД = &ЧатИД";

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		СоздатьЗаписьОПользователе(ЧатИД, ИмяПользователя, Ответ);
		Возврат Ответ;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Субдомен) Тогда
			ОсновнойСкрипт(ЧатИД, ПакетСообщения, Запрос, Выборка, Ответ);
		Иначе
			ЗаписатьСубДоменПользователя(ЧатИД, ИмяПользователя, ПакетСообщения, Ответ);
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ОсновнойСкрипт(ЧатИД, ПакетСообщения, Запрос, Выборка, Ответ)
	Если ПакетСообщения.message.text = "/start" Тогда
		ПриветственноеСообщение = "Хало, с помощью этого бота ты можешь:" + Символы.ПС + "/gif - Получить гифку"
			+ Символы.ПС + "/cur - Получить курс $" + Символы.ПС + "/wthr - Получить прогноз погоды" + Символы.ПС
			+ "/crm - управление amoCrm";
		ОтправитьСообщениеТГ(ЧатИД, ПриветственноеСообщение);
	ИначеЕсли Константы.ГифЧек.Получить() = Истина Тогда
		ОтправитьГифТГ(ЧатИД, ПакетСообщения.message.text);
		Константы.ГифЧек.Установить(Ложь);
	ИначеЕсли Константы.ДобавитьЧек.Получить() = Истина Тогда
		Деление = СтрНайти(ПакетСообщения.message.text, "\");
		ТекстЗадачи = Лев(ПакетСообщения.message.text, Деление - 2);
		Дедлайн = Прав(ПакетСообщения.message.text, 10);
		ВыборкаНовая = Запрос.Выполнить().Выбрать();
		Пока ВыборкаНовая.Следующий() Цикл
			Если Выборка.ЧатИД = ЧатИД Тогда
				Субдомен = Выборка.Субдомен;
			КонецЕсли;
		КонецЦикла;
		ДобавитьЗадачуНаСервере(ЧатИД, ТекстЗадачи, Дедлайн, Субдомен);
		Константы.СРМЧек.Установить(Ложь);
		Константы.ДобавитьЧек.Установить(Ложь);
	ИначеЕсли Константы.СРМЧек.Получить() = Истина И ПакетСообщения.message.text = "/show" Тогда
		ПолучитьЗадачиНаСервере(ЧатИД);
		ОтправитьСообщениеТГ(ЧатИД, "Задачи успешно показаны!" + Символы.ПС
			+ "Для продолжения работы с CRM введите /crm");
		Константы.СРМЧек.Установить(Ложь);
	ИначеЕсли Константы.СРМЧек.Получить() = Истина И ПакетСообщения.message.text = "/add" Тогда
		СпроситьЗадачу(ЧатИД);
		Константы.ДобавитьЧек.Установить(Истина);
		Константы.СРМЧек.Установить(Ложь);
	ИначеЕсли ПакетСообщения.message.text = "/gif" Тогда
		Гиф(ЧатИД);
		Константы.ГифЧек.Установить(Истина);
	ИначеЕсли ПакетСообщения.message.text = "/cur" Тогда
		Кур(ЧатИД);
	ИначеЕсли ПакетСообщения.message.text = "/wthr" Тогда
		Везер(ЧатИД);
	ИначеЕсли ПакетСообщения.message.text = "/crm" Тогда
		Срм(ЧатИД);
		Константы.СРМЧек.Установить(Истина);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СоздатьЗаписьОПользователе(ЧатИД, ИмяПользователя, Ответ)
	Запись = РегистрыСведений.АккаунтыПользователей.СоздатьМенеджерЗаписи();
	Запись.ЧатИД = ЧатИД;
	Запись.ИмяПользователя = ИмяПользователя;
	Запись.Записать();
	ОтправитьСообщениеТГ(ЧатИД, "У нас нет информации о твоей компании. Введи ее название:");
	Возврат Ответ;
КонецФункции

Функция ЗаписатьСубДоменПользователя(ЧатИД, ИмяПользователя, ПакетСообщения, Ответ)

	Запись = РегистрыСведений.АккаунтыПользователей.СоздатьМенеджерЗаписи();
	Запись.ЧатИД = ЧатИД;
	Запись.ИмяПользователя = ИмяПользователя;
	Запись.Субдомен = Null;
	Запись.Прочитать();
	Запись.Субдомен = ПакетСообщения.message.text;
	Запись.Записать();
	ОтправитьСообщениеТГ(ЧатИД, "Успешно! Можете начинать работать с ботом");
	Возврат Ответ;
КонецФункции

Функция СпроситьЗадачу(ЧатИД)

	ОтправитьСообщениеТГ(ЧатИД, "Задайте задачу в формате: " + Символы.ПС + "<описание> \ <дедлайн>" + Символы.ПС
		+ "Пример:" + Символы.ПС + "сказать Виталику что он классный \ 29.09.2021");

КонецФункции

Процедура ДобавитьЗадачуНаСервере(ЧатИД, ОписаниеЗадачи, Дедлайн, Субдомен)
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ТелоМассив = Новый Массив(1);
	Данные = Новый Структура;
	Данные.Вставить("task_type_id", 1);
	Данные.Вставить("text", ОписаниеЗадачи);
	Данные.Вставить("complete_till", Число(Формат(Дата(Прав(Дедлайн, 4), Сред(Дедлайн, 4, 2), Сред(Дедлайн, 0, 2))
		- дата(1970, 1, 1, 1, 0, 0), "ЧГ=0")));
	ТелоМассив[0] = Данные;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ДанныеПодключенияСРМ.АксесТокен,
				   |	ДанныеПодключенияСРМ.Субдомен
				   |ИЗ
				   |	РегистрСведений.ДанныеПодключенияСРМ КАК ДанныеПодключенияСРМ";
	Выборка = Запрос.Выполнить().Выбрать();
	Запись = РегистрыСведений.ДанныеПодключенияСРМ.СоздатьМенеджерЗаписи();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Субдомен = Субдомен Тогда
			АксесТекущий = Выборка.АксесТокен;
		Иначе
			ОтправитьСообщениеТГ(ЧатИД, "Вашей организации нет в базе. Обратитесь к администратору");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ЗаписатьJSON(JSONЗапрос, ТелоМассив);
	СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Authorization", "Bearer " + АксесТекущий);
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	//АдресРесурса = СтрСоединить(ПараметрыЗапроса, "&");
	АдресРесурса = "/api/v4/tasks";
	Соединение = Новый HTTPСоединение(Субдомен + ".amocrm.ru", 443, , , ИнтернетПрокси, ,
		Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	Запрос.УстановитьТелоИзСтроки(СтрокаJS);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос);
	ОкноОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ОтправитьСообщениеТГ(ЧатИД, "Задача успешно добавлена!" + Символы.ПС + "Для продолжения работы с CRM введите /crm");

КонецПроцедуры

Процедура ПолучитьЗадачиНаСервере(ЧатИД)
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Authorization", "Bearer " + Константы.АксесТокен.Получить());
	АдресРесурса = "/api/v4/tasks";
	Соединение = Новый HTTPСоединение("salamalecum.amocrm.ru", 443, , , ИнтернетПрокси, ,
		Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = Разобратьпакет(Ответ);
	КоличествоЗадач = ПакетСообщения._embedded.tasks.Количество();
	Счетчик = 0;
	ЗадачиОтвет = "";
	Пока Счетчик < КоличествоЗадач Цикл

		ЗадачиОтвет = ЗадачиОтвет + (Счетчик + 1) + ". " + ПакетСообщения._embedded.tasks[Счетчик].text + " до "
			+ Формат(TimestampВДату(ПакетСообщения._embedded.tasks[Счетчик].complete_till), "ДЛФ=ДД") + Символы.ПС;
		Счетчик = Счетчик + 1;

	КонецЦикла;
	ОтправитьСообщениеТГ(ЧатИД, ЗадачиОтвет);
КонецПроцедуры

Функция TimestampВДату(пДатаТС)
	Попытка
		Возврат Дата("19700101") + ?(ТипЗнч(пДатаТС) = Тип("Строка"), Число(пДатаТС), пДатаТС);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция Гиф(ЧатИД)
	ОтправитьСообщениеТГ(ЧатИД, ("Ключевое слово:"));
КонецФункции

Функция Кур(ЧатИД)
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	АдресРесурса = "/daily_json.js";
	Соединение = Новый HTTPСоединение("www.cbr-xml-daily.ru", 443, , , ИнтернетПрокси, ,
		Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = Разобратьпакет(Ответ);
	ДатаНормальная = Дата(Лев(ПакетСообщения.Date, 4), Сред(ПакетСообщения.Date, 6, 2), Сред(ПакетСообщения.Date, 9, 2));
	ОтправитьСообщениеТГ(ЧатИД, "По состоянию на " + Формат(ДатаНормальная, "ДЛФ=ДД") + ":" + Символы.ПС + "1 "
		+ ПакетСообщения.Valute.GBP.CharCode + " = " + ПакетСообщения.Valute.GBP.Value + " RUB" + " ("
		+ ((ПакетСообщения.Valute.GBP.Value) - (ПакетСообщения.Valute.GBP.Previous)) + ")" + Символы.ПС + "1 "
		+ ПакетСообщения.Valute.USD.CharCode + " = " + ПакетСообщения.Valute.USD.Value + " RUB" + " ("
		+ ((ПакетСообщения.Valute.USD.Value) - (ПакетСообщения.Valute.USD.Previous)) + ")" + Символы.ПС + "1 "
		+ ПакетСообщения.Valute.EUR.CharCode + " = " + ПакетСообщения.Valute.EUR.Value + " RUB" + " ("
		+ ((ПакетСообщения.Valute.EUR.Value) - (ПакетСообщения.Valute.EUR.Previous)) + ")" + Символы.ПС);
КонецФункции

Функция Везер(ЧатИД)
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	АдресРесурса = "/data/2.5/weather?q=Arkhangelsk&appid=77df51578b034fb56115bf10256a6d0a&units=metric&lang=ru";
	Соединение = Новый HTTPСоединение("api.openweathermap.org", 443, , , ИнтернетПрокси, ,
		Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	ПакетДжсон = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетДжсон = СтрЗаменить(ПакетДжсон, "1h", "h1");
	ПакетСообщения = Разобратьпакет(ПакетДжсон);
	ОтправитьСообщениеТГ(ЧатИД, "По состоянию на " + ТекущаяДатаСеанса() + " в Архангельске "
		+ ПакетСообщения.main.temp + "°C. Влажность: " + ПакетСообщения.main.humidity + "%");
КонецФункции

Функция Срм(ЧатИД)
	ОтправитьСообщениеТГ(ЧатИД, ("Показать задачи: /show" + Символы.ПС + "Добавить задачу: /add"));
КонецФункции

Функция ОтправитьСообщениеТГ(ЧатИД, ТекстСообщения)

	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	АдресРесурса = "/bot" + Константы.TelegramBotToken.Получить() + "/sendMessage?chat_id=" + XMLСтрока(ЧатИД)
		+ "&text=" + ТекстСообщения;
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , ИнтернетПрокси, , Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос);

КонецФункции

Функция ОтправитьГифТГ(ЧатИД, КлючевоеСлово)
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	АдресРесурса = "/v1/gifs/random?api_key=" + Константы.ГифиТокен.Получить() + "&tag=" + КлючевоеСлово;
	Соединение = Новый HTTPСоединение("api.giphy.com", 443, , , ИнтернетПрокси, , Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	СтрокаСОшибкой = РезультатЗапроса.ПолучитьТелоКакСтроку();
	СтрокаБезОшибки = СтрЗаменить(СтрокаСОшибкой, "480w_still", "still_480w");
	ПакетСообщения = Разобратьпакет(СтрокаБезОшибки);

	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	АдресРесурса = "/bot" + Константы.TelegramBotToken.Получить() + "/sendDocument?chat_id=" + XMLСтрока(ЧатИД)
		+ "&document=" + ПакетСообщения.data.images.downsized_large.url;
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , ИнтернетПрокси, , Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос);
КонецФункции

Функция Разобратьпакет(СтрокаJSON)
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаJSON);
		Данные = ПрочитатьJSON(Чтение, Ложь, , , , , , , 10000);
		Чтение.Закрыть();
		Возврат Данные;
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
КонецФункции

Функция msgGetMethod(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция msgPostMethod(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция messageGetMethod(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("GetMethod is working");
	Возврат Ответ;
КонецФункции
